# St7ConvertToNURBS

Converts the selected geometry faces to NURBS.

long St7ConvertToNURBS(long uID)

Input Parameters

uID

Strand7 model file ID.

Dependencies
Selection

Entities can be selected using functions in Entity Selection.

Keep Selected

Assigned using St7SetKeepSelect.

Global Parameters

ivFacesChanged, ivFacesFailed.